[0.08618206530809402, 0.07674834132194519, 0.06215840205550194, 0.04138055816292763, 0.02152879908680916, 0.014723962172865868, 0.013511935248970985, 0.013197706080973148, 0.013322174549102783, 0.01326875202357769, 0.013233109377324581, 0.013247841969132423, 0.013255343772470951, 0.013251434080302715, 0.01325230672955513, 0.013255010358989239, 0.013255788944661617, 0.013256610371172428, 0.013257856480777264, 0.013258857652544975, 0.013259761966764927, 0.013260701671242714, 0.013261585496366024, 0.013262421824038029, 0.013263236731290817, 0.013264019973576069, 0.013264769688248634, 0.01326549518853426, 0.013266194611787796, 0.013266867958009243, 0.0132675189524889, 0.013268149457871914, 0.013268759474158287, 0.013269349001348019, 0.013269918039441109, 0.01327047310769558, 0.013271009549498558, 0.013271529227495193, 0.013272034004330635, 0.013272522017359734, 0.013272998854517937, 0.013273460790514946, 0.013273907825350761, 0.01327434554696083, 0.01327476929873228, 0.013275181874632835, 0.013275585137307644, 0.013275976292788982, 0.013276358135044575, 0.013276730664074421, 0.013277093879878521, 0.013277447782456875, 0.013277792371809483, 0.013278128579258919, 0.013278454542160034, 0.013278776779770851, 0.013279089704155922, 0.013279394246637821, 0.013279693201184273, 0.013279984705150127, 0.013280270621180534, 0.013280550017952919, 0.013280820101499557, 0.013281088322401047, 0.013281346298754215, 0.013281602412462234, 0.013281852006912231, 0.013282096944749355, 0.013282335363328457, 0.01328256819397211, 0.013282797299325466, 0.013283020816743374, 0.013283241540193558, 0.01328345574438572, 0.013283666223287582, 0.013283872976899147, 0.013284074142575264, 0.013284272514283657, 0.013284469023346901, 0.013284658081829548, 0.013284842483699322, 0.013285026885569096, 0.013285205699503422, 0.013285382650792599, 0.013285554014146328, 0.013285722583532333, 0.01328588929027319, 0.013286052271723747, 0.013286211527884007, 0.013286367990076542, 0.013286520726978779, 0.013286673463881016, 0.013286820612847805, 0.01328696496784687, 0.013287106528878212, 0.013287247158586979, 0.013287384994328022, 0.013287520036101341, 0.013287650421261787, 0.013287782669067383]{"p_1": 30, "p_2": 30, "p_3": 30, "device": "GPU", "n_epochs": 100, "index": 450, "alpha": 0.5, "folder_path": "data/test_data/big_dataset_fno/heat2d/", "best_loss": 5e-05}{"n_layers": 8, "dim_coords": 2, "n_modes": 30, "activation": "relu", "kernel_initializer": "he_normal"}{"first_network": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 900, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [30, 30]}}]}, "last_network": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 900, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [30, 30]}}]}}