[0.08602412045001984, 0.07487501204013824, 0.055902764201164246, 0.030696818605065346, 0.014285078272223473, 0.009504512883722782, 0.006011516321450472, 0.0027734164614230394, 0.0013620108366012573, 0.0009598416509106755, 0.000757252739276737, 0.0006434388924390078, 0.0005655151326209307, 0.0005088371690362692, 0.00046167816617526114, 0.0004228440811857581, 0.0003879732685163617, 0.0003588638792280108, 0.0003349606122355908, 0.00031710960320197046, 0.0003035218978766352, 0.0002917459059972316, 0.00028130406280979514, 0.00027121201856061816, 0.00026189821073785424, 0.00025232217740267515, 0.00024277475313283503, 0.00023515158682130277, 0.00022734237427357584, 0.00022060875198803842, 0.00021467573242262006, 0.0002097228862112388, 0.00020389458222780377, 0.00019750423962250352, 0.00019103671365883201, 0.00018627279496286064, 0.00018230723799206316, 0.00017917911463882774, 0.00017664331244304776, 0.0001741353771649301, 0.0001699314161669463, 0.00016698551189620048, 0.00016334193060174584, 0.000159732298925519, 0.00015542449546046555, 0.00015121766773518175, 0.0001472584845032543, 0.0001436565216863528, 0.00013982642849441618, 0.00013556746125686914, 0.00013141616364009678, 0.0001288752246182412, 0.00012779505050275475, 0.00012666935799643397, 0.0001257624535355717, 0.0001246171595994383, 0.00012356776278465986, 0.00012356087972875684, 0.00012472184607759118, 0.0001249349006684497, 0.00012294776388444006, 0.00012104123015888035, 0.00012063413305440918, 0.00012177839380456135, 0.0001231013739015907, 0.00012238709314260632, 0.00012035117106279358, 0.00011898475349880755, 0.00011875194468302652, 0.00011863574763992801, 0.00011909975000889972, 0.00012003460869891569, 0.0001204810178023763, 0.00012047811469528824, 0.00011929532774956897, 0.00011799295316450298, 0.00011711660772562027, 0.00011629025539150462, 0.00011598739365581423, 0.0001157279621111229, 0.00011572039511520416, 0.00011594405805226415, 0.00011624788021435961, 0.00011756778985727578, 0.00011999731214018539, 0.00012364894791971892, 0.00012647498806472868, 0.00012251026055309922, 0.00011822803207905963, 0.00011689527309499681, 0.00011703067866619676, 0.00011719573376467451, 0.00011719081521732733, 0.00011624606850091368, 0.00011600977450143546, 0.00011585242464207113, 0.00011520890984684229, 0.00011640324373729527, 0.00011656925926217809, 0.00011757826723624021]{"p_1": 30, "p_2": 30, "p_3": 30, "device": "GPU", "n_epochs": 100, "index": 450, "alpha": 0.5, "folder_path": "data/test_data/big_dataset_fno/heat2d/", "best_loss": 5e-05}{"n_layers": 4, "dim_coords": 2, "n_modes": 30, "activation": "relu", "kernel_initializer": "he_normal"}{"first_network": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 900, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [30, 30]}}]}, "last_network": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 900, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [30, 30]}}]}}