[0.07789833843708038, 0.02473698928952217, 0.003773799864575267, 0.0008761609205976129, 0.00033003464341163635, 0.0002038336533587426, 0.000167187288752757, 0.00015495320258196443, 0.00015044344763737172, 0.00014895225467626005, 0.00014500378165394068, 0.000140480711706914, 0.00013431475963443518, 0.0001314889086643234, 0.0001283905585296452, 0.00012751217582263052, 0.0001249743945663795, 0.0001220345584442839, 0.00012009058991679922, 0.0001217602621181868, 0.00012305888230912387, 0.00011919093958567828, 0.0001162098124041222, 0.00011364280362613499, 0.0001115181075874716, 0.00011026751599274576, 0.00010858374298550189, 0.00010663522698450834, 0.0001038998962030746, 0.00010077938350150362, 9.773064812179655e-05, 9.410171333001927e-05, 9.02724132174626e-05]{"p_1": 30, "p_2": 30, "p_3": 30, "device": "GPU", "n_epochs": 100, "index": 450, "alpha": 0.5, "folder_path": "data/test_data/big_dataset_fno/heat2d/", "best_loss": 0.0001}{"n_layers": 1, "dim_coords": 2, "n_modes": 30, "activation": "relu", "kernel_initializer": "he_normal"}{"first_network": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 900, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [30, 30]}}]}, "last_network": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 900, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [30, 30]}}]}}